<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"417bd93c734451170952cf41f424c937be30b9a13b9cbebd17e9558c24faa167","plan_job_ref":"Job Create terraform plan #31 at https://github.com/presentium/infrastructure/actions/runs/10288607252","plan_out_hash":"e68b95553fc8a5b61940f69f7644e1256e1b407ad0c0f380baea9be0aa7b8caf","plan_hash":"95ef3ae2d32f6ae7a2404aa81c39198d81c1f27d4485d96c1a2efb42dd8074bd","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 4 to add, 0 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.argocd.null_resource.argocd_apply_once is tainted, so must be replaced
-/+ resource "null_resource" "argocd_apply_once" {
!~      id       = "*******************" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.eks.module.eks.aws_eks_access_entry.this["cicd"] will be created
+   resource "aws_eks_access_entry" "this" {
+       access_entry_arn  = (known after apply)
+       cluster_name      = "presentium"
+       created_at        = (known after apply)
+       id                = (known after apply)
+       kubernetes_groups = [
+           "system:masters",
        ]
+       modified_at       = (known after apply)
+       principal_arn     = "arn:aws:iam::123247571664:role/cicd"
+       tags              = {
+           "karpenter.sh/discovery" = "presentium"
        }
+       tags_all          = {
+           "Terraform"              = "true"
+           "karpenter.sh/discovery" = "presentium"
        }
+       type              = "STANDARD"
+       user_name         = (known after apply)
    }

  # module.eks.module.eks.aws_eks_access_policy_association.this["admins_admin"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = "presentium"
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
+       principal_arn = "arn:aws:iam::123247571664:role/PRES-EKS-ADMIN"

+       access_scope {
+           type = "cluster"
        }
    }

  # module.eks.module.eks.aws_eks_access_policy_association.this["admins_example"] will be destroyed
  # (because key ["admins_example"] is not in for_each map)
-   resource "aws_eks_access_policy_association" "this" {
-       associated_at = "2024-08-07 16:18:20.056 +0000 UTC" -> null
-       cluster_name  = "presentium" -> null
-       id            = "presentium#arn:aws:iam::123247571664:role/PRES-EKS-ADMIN#arn:aws:eks::aws:cluster-access-policy/AmazonEKSViewPolicy" -> null
-       modified_at   = "2024-08-07 16:18:20.056 +0000 UTC" -> null
-       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSViewPolicy" -> null
-       principal_arn = "arn:aws:iam::123247571664:role/PRES-EKS-ADMIN" -> null

-       access_scope {
-           namespaces = [] -> null
-           type       = "cluster" -> null
        }
    }

  # module.eks.module.eks.aws_eks_access_policy_association.this["cicd_edit"] will be created
+   resource "aws_eks_access_policy_association" "this" {
+       associated_at = (known after apply)
+       cluster_name  = "presentium"
+       id            = (known after apply)
+       modified_at   = (known after apply)
+       policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSEditPolicy"
+       principal_arn = "arn:aws:iam::123247571664:role/cicd"

+       access_scope {
+           type = "cluster"
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```
</details>

:x: Error applying plan in [Apply terraform plan #12](https://github.com/presentium/infrastructure/actions/runs/10288632038)